import React from 'react';
import './style.css';

const formattedNow = (() => {
  const now = new Date();
  const year = now.getFullYear();
  const month = String(now.getMonth() + 1).padStart(2, '0');
  const date = String(now.getDate()).padStart(2, '0');
  return [year, month, date].join('.');
})();

function Introduce() {
  return (
    <div className="container">
      <h1>학력 🎓</h1>
      <p>대전대학교 컴퓨터공학과 졸업 (2013.03.02 ~ 2019.02.22)</p>

      <h1>경력 💼</h1>
      <p>{`(주)모두텍 (2019.01.07 ~ ${formattedNow}) - 재직 중`}</p>

      <h1>프로젝트 목록 📜</h1>

      <h2>대학교</h2>

      <h3>창업동아리 (2017년)</h3>
      <p>BLE를 이용한 미아방지 하드웨어 및 안드로이드 어플리케이션 개발</p>
      <p>Android Developers의 BLE example 을 이해하고 수정하여 개발하였습니다.</p>
      <p>android studio로 당시엔 kotlin 이 나오기 전이라 java를 이용하여 개발하였습니다.</p>
      <p>블루투스 페어링을 통해 미아방지 디바이스와 안드로이드 어플 간 페어링을 하고,</p>
      <p>일정거리 이상 멀어지면 스마트폰과 디바이스 모두 경고음이 나며, 스마트폰에 notification 알람을 발생시켰습니다.</p>

      <h3>대전대학교 산업기술연구소 제 29권 1호 논문 등재 (2018년)</h3>
      <p>그리드 맵에서 오일러 트레일을 이용한 거리비용 최소 커버리지 경로 계획 알고리즘</p>
      <p>한창 알고리즘 문제에 빠져있을 때, 교수님께서 논문 아이디어를 생각해보라고 하셔서 떠올린 아이디어 입니다.</p>
      <p>지도 상의 모든 셀을 지나도록 이동하는 경로를 계획하고 청소로봇, 잔디로봇, 지뢰 제거용 로봇, 수확 로봇 등에 사용되는 커버리지 경로계획에 있어</p>
      <p>당시 알고리즘들은 지도의 형태, 로봇 출발점의 위치, 측정 오차 등에 따라 최적 경로와 최악 경로의 비용차이가 크게 발생한다는 점을 발견하였습니다.</p>
      <p>이러한 비용차이의 주 원인은 지나온 영역을 다시 지나는 경로가 생성되기 때문이고</p>
      <p>이를 최소화하기 위해 오일러 트레일(한붓그리기)를 이용하여 재방문하는 셀을 최소화하는 알고리즘에 대한 내용입니다.</p>

      <h3>졸업논문 (2019년)</h3>
      <p>수직과 수평방향 동시제어가 가능한 모빌 원격제어 시스템 구현</p>
      <p>아두이노, 블루투스 모듈, 모터 2개, 3D 프린터로 만든 하드웨어 케이스, 제어를 위한 안드로이드 어플을 이용한 모빌 제어시스템을 만들었습니다.</p>
      <p>블루투스 페어링은 창업동아리 활동으로 경험을 했기 때문에 큰 어려움이 없었지만</p>
      <p>수직과 수평방향이 동시에 제어할 수 있도록 구조물을 설계하는 과정이 가장 어려웠습니다.</p>
      <p> 원기둥에 작은 원기둥이 들어갈 수 있도록 구멍을 뚫었고</p>
      <p>큰 원기둥이 회전하면, 모빌이 수평적으로 회전하고, 작은 원기둥이 회전하면 수직 줄 길이를 제어하였습니다.</p>

      <h2>모두텍</h2>

      <h3>빅데이터 허브 서비스, SODAS (2019년, 3달)</h3>

      <h3>도시교통 혼잡도 예측, SALT (2019년~2021년)</h3>

      <h3>도시 행정 정책 분석을 위한 기계학습 기반 데이터 통합 도구 개발 (2019년, 6달)</h3>

      <h3>스마트시티 어플 개발 (2020년, 3달)</h3>

      <h3>주파수 기반 기계학습 알고리즘 실행도구, MLP4FA (2020년~2021년)</h3>

      <h3>웹 기반 채팅 개발 (2019년, 3달)</h3>

      <h3>레이더 가시화 개발 (2020년, 2달)</h3>

      <h3>나눔 채팅 프로그램 개발 (2021년, 3달)</h3>

      <h3>도시교통브레인 (2021년)</h3>

      <h3>오픈소스 기반 데이터 유통 서비스 구축 (2022년, 3달)</h3>

      <h2>사이드 프로젝트</h2>

      <h3>백준, programmers 알고리즘 문제해결</h3>

      <h3>디자인패턴 공부</h3>

      <h3>MVVM 이해를 위한 웹 기반 지뢰찾기 만들기</h3>

      <h3>github 자기소개 page 만들기</h3>
    </div>
  );
}
export default Introduce;
